morfredus/ESP32-Diagnostic/src/main.cpp
  return true;
}

String getOLEDStepLabel(const String &stepId) {
  if (stepId == "welcome") return String(Texts::oled_step_welcome);
  if (stepId == "big_text") return String(Texts::oled_step_big_text);
  if (stepId == "text_sizes") return String(Texts::oled_step_text_sizes);
  if (stepId == "shapes") return String(Texts::oled_step_shapes);
  if (stepId == "horizontal_lines") return String(Texts::oled_step_horizontal_lines);
  if (stepId == "diagonals") return String(Texts::oled_step_diagonals);
  if (stepId == "moving_square") return String(Texts::oled_step_moving_square);
  if (stepId == "progress_bar") return String(Texts::oled_step_progress_bar);
  if (stepId == "scroll_text") return String(Texts::oled_step_scroll_text);
  if (stepId == "final_message") return String(Texts::oled_step_final_message);
  return stepId;
}

void testOLED() {
  if (!oledAvailable || oledTested) return;

  Serial.println("\r\n=== TEST OLED ===");

  oledStepWelcome();
  oledStepBigText();
  oledStepTextSizes();
  oledStepShapes();
  oledStepHorizontalLines();
  oledStepDiagonals();
  oledStepMovingSquare();
  oledStepProgressBar();
  oledStepScrollText();
  oledStepFinalMessage();

  oledTested = true;
  oledTestResult = String(Texts::test) + " " + String(Texts::ok) + " - 128x64";
  Serial.println("OLED: Tests complets OK\r\n");
}

void resetOLEDTest() {
  oledTested = false;
  if (oledAvailable) {
    oled.clearBuffer();
    oled.sendBuffer();
  }
}

void oledShowMessage(String message) {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, message.c_str());
  oled.sendBuffer();
}

// WiFi connection status banner on OLED
void oledShowWiFiStatus(const String& title,
                        const String& detail,
                        const String& footer,
                        int progressPercent) {
  if (!oledAvailable) {
    return;
  }

  int clampedProgress = progressPercent;
  if (clampedProgress < 0) {
    clampedProgress = -1;
  } else if (clampedProgress > 100) {
    clampedProgress = 100;
  }

  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 12, title.c_str());

  if (detail.length() > 0) {
    oled.drawStr(0, 28, detail.c_str());
  }

  if (footer.length() > 0) {
    oled.drawStr(0, 44, footer.c_str());
  }

  if (clampedProgress >= 0) {
    const int barX = 8;
    const int barY = 52;
    const int barWidth = SCREEN_WIDTH - (barX * 2);
    const int barHeight = 10;
    oled.drawFrame(barX, barY, barWidth, barHeight);
    int fillWidth = (barWidth - 2) * clampedProgress / 100;
    if (fillWidth > 0) {
      oled.drawBox(barX + 1, barY + 1, fillWidth, barHeight - 2);
    }
  }

  oled.sendBuffer();
}

// ========== TEST ADC ==========
void testADC() {
  Serial.println("\r\n=== TEST ADC ===");
  adcReadings.clear();
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    int adcPins[] = {36, 39, 34, 35, 32, 33};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    int adcPins[] = {1, 2, 3, 4, 5, 6};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    int adcPins[] = {0, 1, 2, 3, 4};
    int numADC = 5;
  #else
    int adcPins[] = {36, 39};
    int numADC = 2;
  #endif

  for (int i = 0; i < numADC; i++) {
    ADCReading reading;
    reading.pin = adcPins[i];
    reading.rawValue = analogRead(adcPins[i]);
    reading.voltage = (reading.rawValue / 4095.0) * 3.3;
    adcReadings.push_back(reading);

    Serial.printf("GPIO%d: %d (%.2fV)\r\n", reading.pin, reading.rawValue, reading.voltage);
  }
  
  adcTestResult = String(numADC) + " " + String(Texts::channels) + " - " + String(Texts::ok);
  Serial.printf("ADC: %d canaux testes\r\n", numADC);
}

// ========== TEST PWM ==========
void testPWM() {
  Serial.println("\r\n=== TEST PWM ===");
  int testPin = 2;

  #ifdef CONFIG_IDF_TARGET_ESP32S3
    testPin = 48;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    testPin = 8;
  #endif

  Serial.printf("Test PWM sur GPIO%d\r\n", testPin);

  // --- [PLATFORMIO FIX] Use legacy LEDC API for PlatformIO compatibility ---
  uint8_t pwmChannel = 0;
  ledcSetup(pwmChannel, 5000, 8);       // channel, freq, resolution
  ledcAttachPin(testPin, pwmChannel);    // pin, channel

  for (int duty = 0; duty <= 255; duty += 51) {
    ledcWrite(pwmChannel, duty);         // channel, duty
    Serial.printf("PWM duty: %d/255\r\n", duty);
    delay(80);
    yield();
  }

  ledcWrite(pwmChannel, 0);
  ledcDetachPin(testPin);                // pin

  pwmTestResult = String(Texts::test) + " " + String(Texts::ok) + " - GPIO " + String(testPin);
  Serial.println("PWM: OK");
}

// ========== SCAN SPI ==========
void scanSPI() {
  Serial.println("\r\n=== SCAN SPI ===");
  spiInfo = "";
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    spiInfo = "HSPI (12,13,14,15), VSPI (18,19,23,5)";
    Serial.println("SPI: HSPI + VSPI disponibles");
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    spiInfo = "SPI2 disponible";
    Serial.println("SPI: SPI2");
  #else
    spiInfo = "Info SPI non disponible";
  #endif
}

// ========== LISTING PARTITIONS ==========
void listPartitions() {
  Serial.println("\r\n=== PARTITIONS FLASH ===");
  partitionsInfo = "";
  
  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  
  int count = 0;
  while (it != NULL) {
    const esp_partition_t *part = esp_partition_get(it);
    
    char line[128];
    sprintf(line, "%s - Type:0x%02x Addr:0x%08x Size:%dKB", 
            part->label, part->type, part->address, part->size / 1024);
    
    if (count > 0) partitionsInfo += "\r\n";
    partitionsInfo += String(line);
    
    Serial.println(line);
    
    it = esp_partition_next(it);
    count++;
  }
  
  esp_partition_iterator_release(it);
  Serial.printf("Total: %d partitions\r\n", count);
}

// TEST LED RGB
void testRGBLed() {
  Serial.println("\r\n=== TEST LED RGB ===");

  if (RGB_LED_PIN_R < 0 || RGB_LED_PIN_G < 0 || RGB_LED_PIN_B < 0) {
    rgbLedTestResult = String(Texts::configuration_invalid);
    rgbLedAvailable = false;
    Serial.println("LED RGB: Configuration invalide");
    return;
  }

  pinMode(RGB_LED_PIN_R, OUTPUT);
  pinMode(RGB_LED_PIN_G, OUTPUT);
  pinMode(RGB_LED_PIN_B, OUTPUT);

  Serial.printf("Test LED RGB - R:%d G:%d B:%d\r\n", RGB_LED_PIN_R, RGB_LED_PIN_G, RGB_LED_PIN_B);

