morfredus/ESP32-Diagnostic/src/main.cpp
  // Footer
  html += "<div class='footer'>";
  html += "ESP32 Diagnostic v"+ String(PROJECT_VERSION) + " | " + diagnosticData.chipModel + " | MAC: " + diagnosticData.macAddress;
  html += "</div>";
  
  html += "</body></html>";
  
  server.send(200, "text/html; charset=utf-8", html);
}

String htmlEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length() * 6);
  for (size_t i = 0; i < raw.length(); ++i) {
    char c = raw[i];
    switch (c) {
      case '&':
        escaped += "&amp;";
        break;
      case '<':
        escaped += "&lt;";
        break;
      case '>':
        escaped += "&gt;";
        break;
      case '\"':
        escaped += "&quot;";
        break;
      case '\'':
        escaped += "&#39;";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

String jsonEscape(const char* raw) {
  if (raw == nullptr) {
    return "";
  }

  const size_t rawLength = strlen(raw);
  String escaped;
  escaped.reserve(rawLength * 2);
  while (*raw) {
    char c = *raw++;
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

static inline void appendJsonField(String& json, bool& first, const JsonFieldSpec& field) {
  if (!first) {
    json += ',';
  }
  first = false;
  json += '"';
  json += field.key;
  json += '"';
  json += ':';
  if (field.raw) {
    json += field.value;
  } else {
    json += '"';
    json += jsonEscape(field.value.c_str());
    json += '"';
  }
}

String buildJsonObject(std::initializer_list<JsonFieldSpec> fields) {
  String json;
  json.reserve(fields.size() * 50 + 10);  // Estimate size based on field count
  json = "{";
  bool first = true;
  for (const auto& field : fields) {
    appendJsonField(json, first, field);
  }
  json += '}';
  return json;
}

inline void sendJsonResponse(int statusCode, std::initializer_list<JsonFieldSpec> fields) {
  server.send(statusCode, "application/json", buildJsonObject(fields));
}

static String buildActionResponseJson(bool success,
                                      const String& message,
                                      std::initializer_list<JsonFieldSpec> extraFields) {
  String json;
  json.reserve(extraFields.size() * 50 + message.length() + 50);  // Estimate size
  json = "{";
  bool first = true;
  appendJsonField(json, first, jsonBoolField("success", success));
  if (message.length() > 0) {
    appendJsonField(json, first, jsonStringField("message", message));
  }
  for (const auto& field : extraFields) {
    appendJsonField(json, first, field);
  }
  json += '}';
  return json;
}

inline void sendActionResponse(int statusCode,
                               bool success,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields) {
  server.send(statusCode, "application/json", buildActionResponseJson(success, message, extraFields));
}

inline void sendOperationSuccess(const String& message,
                                 std::initializer_list<JsonFieldSpec> extraFields) {
  sendActionResponse(200, true, message, extraFields);
}

inline void sendOperationError(int statusCode,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields) {
  sendActionResponse(statusCode, false, message, extraFields);
}

static inline void appendInfoItem(String& chunk,
                                  const char* labelKey,
                                  const char* labelText,
                                  const String& valueText,
                                  const String& valueAttrs = String(),
                                  const String& wrapperAttrs = String()) {
  chunk += F("<div class='info-item'");
  if (wrapperAttrs.length() > 0) {
    chunk += ' ';
    chunk += wrapperAttrs;
  }
  chunk += F("><div class='info-label");
  if (labelKey != nullptr && labelKey[0] != '\0') {
    chunk += F(" data-i18n='");
    chunk += labelKey;
    chunk += F("'>");
  } else {
    chunk += F("'>");
  }
  chunk += labelText;
  chunk += F("</div><div class='info-value'");
  if (valueAttrs.length() > 0) {
    chunk += ' ';
    chunk += valueAttrs;
  }
  chunk += F(">");
  chunk += valueText;
  chunk += F("</div></div>");
}

// Dynamic bilingual string export for the web interface
String buildTranslationsJSON(Language lang) {
  String json;
  json.reserve(20000);
  json += '{';
  bool first = true;
  size_t count = 0;
  const Texts::ResourceEntry* const entries = Texts::getResourceEntries(count);
  for (size_t i = 0; i < count; ++i) {
    const Texts::ResourceEntry& entry = entries[i];
    if (entry.field == nullptr) {
      continue;
    }
    if (!first) {
      json += ',';
    }
    first = false;
    json += '"';
    json += entry.key;
    json += F("\":\"");
    const __FlashStringHelper* raw = entry.field->get(lang);
    String fieldValue;
    if (raw != nullptr) {
      fieldValue = String(raw);
    }
    json += jsonEscape(fieldValue.c_str());
    json += '"';
  }
  json += '}';
  return json;
}

String buildTranslationsJSON() {
  return buildTranslationsJSON(currentLanguage);
}





// Runtime language switching endpoint
void handleSetLanguage() {
  if (!server.hasArg("lang")) {
    sendJsonResponse(400, {
      jsonBoolField("success", false),
      jsonStringField("error", String(Texts::language_switch_error))
    });
    return;
  }

  String lang = server.arg("lang");
  lang.toLowerCase();
  Language target = LANG_EN;
  if (lang == "fr") {
    target = LANG_FR;
  } else if (lang == "en") {
    target = LANG_EN;
  } else {
    sendJsonResponse(400, {
      jsonBoolField("success", false),
      jsonStringField("error", String(Texts::language_switch_error))
    });
    return;
  }

  setLanguage(target);

  String response = F("{\"success\":true,\"language\":\"");
  response += (target == LANG_FR) ? "fr" : "en";
  response += F("\"}");
  server.send(200, "application/json; charset=utf-8", response);
}

